Revit 2027 API
OverrideGraphicSettings.SetSurfaceForegroundPatternId Method
 Sets the ElementId of the surface foreground pattern override. The fill pattern must be a drafting pattern. A value of InvalidElementId means no override is set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetSurfaceForegroundPatternId(
	ElementId fillPatternId
)
Public Function SetSurfaceForegroundPatternId (
	fillPatternId As ElementId
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetSurfaceForegroundPatternId(
	ElementId^ fillPatternId
)
member SetSurfaceForegroundPatternId :
        fillPatternId : ElementId -> OverrideGraphicSettings
Parameters
fillPatternId ElementId
 Value of the surface foreground fill pattern override.
Return Value
OverrideGraphicSettings
 Reference to the changed object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace